project/atropos-go/etcd_concurrent_read-master/master/k150k_range_1_2/output/with_expensive_read/expensive_read.log
bench with linearizable range
 0 / 10 B                                                                                                                                          !   0.00%INFO: 2023/06/12 12:01:58 balancerWrapper: got update addr from Notify: [{localhost:2379 <nil>}]
INFO: 2023/06/12 12:01:58 balancerWrapper: got update addr from Notify: [{localhost:2379 <nil>}]
 10 / 10 Boooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooo! 100.00% 9s

Summary:
  Total:	9.7860 secs.
  Slowest:	1.4381 secs.
  Fastest:	0.1975 secs.
  Average:	0.3769 secs.
  Stddev:	0.3563 secs.
  Requests/sec:	1.0219

Response time histogram:
  0.1975 [1]	|∎∎∎∎∎
  0.3216 [7]	|∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎
  0.4456 [1]	|∎∎∎∎∎
  0.5697 [0]	|
  0.6938 [0]	|
  0.8178 [0]	|
  0.9419 [0]	|
  1.0659 [0]	|
  1.1900 [0]	|
  1.3140 [0]	|
  1.4381 [1]	|∎∎∎∎∎

Latency distribution:
  10% in 0.2211 secs.
  25% in 0.2408 secs.
  50% in 0.2508 secs.
  75% in 0.3465 secs.
  90% in 1.4381 secs.